Autodesk.Revit.DB.Architecture.Stairs.GetAssociatedRailings
Gets a list of the Railing elements which are associated to the boundaries of the stairs.
Remarks:
This does not return railings which are sketched directly to the stairs (and are not
associated to boundaries).
Returns:
The ids of the Railing elements.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.GetStairsSupports
Returns all the stairs support components in the stairs.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.GetStairsLandings
Returns all the stairs landing components in the stairs.
Returns:
The stairs landing components in the stairs.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.GetStairsRuns
Returns all the stairs run components in the stairs.
Returns:
The stairs run components in the stairs.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.IsByComponent(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates if the stairs is created by stairs components(runs, landings and supports).
document:
The document.
stairsId:
The stairs element to check.
Returns:
True if the stairs is created by components, False otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element stairsId does not exist in the document
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.IsInEditMode
Indicates whether the stairs is in edit mode or not.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.MultistoryStairsId
The id of the MultistoryStairs element to which this element belongs.
If this stairs element is not a member of a MultistoryStairs element, this will be InvalidElementId.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.NumberOfStories
The number of stories of a multi-story stair, or 1 for a single-story stair.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.ActualTreadsNumber
The number of treads actually created in the stairs.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.Height
The height of the stair between the base and top levels.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for stairsHeight must be greater than 0 and no more than 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The stairs top level is not "None", so the height cannot be set independently.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.TopElevation
The top elevation of the stairs.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.BaseElevation
The base elevation of the stairs.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.DesiredRisersNumber
The number of risers is calculated based on the height between levels.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for numberOfRisers is not positive.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.ActualRisersNumber
The total number of actually created risers in model.
Remarks:
The number of steps needed to go through when moving from the base level to the top level of the stairs.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.ActualTreadDepth
The actual depth of the stairs treads in the stairs, actual tread depth is equal to minimum tread depth by default.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for actualTreadDepth must be greater than 0 and no more than 30000 feet.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs.ActualRiserHeight
The actual height of the stairs risers in the stairs.
Remarks:
The stairs height is determined by its base and top elevation. So, the actual riser height = stairs height / desired riser number.
Since:
2013

Autodesk.Revit.DB.Architecture.Stairs
Represents a stairs element in Autodesk Revit.
Remarks:
This element may represent a standalone Stairs element, or a member of a MultistoryStairs element.
Use Autodesk.Revit.DB.Architecture.Stairs.MultistoryStairsId to identify if this Stairs element is a part of a MultistoryStairs.
Since:
2013